---
kind: enumMember
id: F:Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.TransitionsOvalToRound
enum: Autodesk.Revit.DB.RoutingPreferenceRuleGroupType
source: html/79896fd9-e90c-6561-3bc4-7cefd4692ae5.htm
---
# Autodesk.Revit.DB.RoutingPreferenceRuleGroupType.TransitionsOvalToRound

The multi-shape transition from the oval profile to the round profile.